# Taps
tap 'homebrew/bundle'

# Binaries
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'gh'
brew 'git'
brew 'grep'
brew 'httpie'
brew 'jq' # Used for spatie/visit
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'rbenv'
brew 'starship'
brew 'deno'
brew 'libpq'
brew 'jpeg-turbo'
brew 'vips'

# Apps
cask 'orbstack'
cask '1password'
cask '1password-cli'
cask 'github'
cask 'helo'
cask 'httpie'
cask 'visual-studio-code'
cask 'iterm2'
cask 'rectangle'
cask 'signal'
cask 'tableplus'
cask 'telegram'

# Quicklook
cask 'qlmarkdown'
cask 'quicklook-json'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-jetbrains-mono-nerd-font'

# Mac App Store
mas 'AffinityDesigner', id: 1616831348
mas 'AffinityPublisher', id: 1606941598
mas 'AffinityPhoto', id: 1616822987
mas 'MoneyMoney', id: 872698314
mas '1PasswordSafari', id: 1569813296